{
  "wcag_dir": "/Users/davinwinkyi/ABDLLM_DataSet_Curation_Pipeline/wcag_techniques",
  "out_dir": "/Users/davinwinkyi/ABDLLM_DataSet_Curation_Pipeline/out",
  "output_rules_dir": "out/wcag_common_failures",
  "filter_mode": "non_functional",
  "allowed_codes": [
    "F7",
    "F25",
    "F26",
    "F32"
  ],
  "rule_count": 4,
  "rules": [
    {
      "rule_id": "F25",
      "error_class": "non_functional",
      "file": "F25.md",
      "path": "out/wcag_common_failures/F25.md",
      "content": "# Technique F25: Failure of Success Criterion 2.4.2 due to the title of a web page not identifying the\n                    contents\n\n## About this Technique\n\nThis technique relates to [2.4.2: Page Titled](https://www.w3.org/WAI/WCAG22/Understanding/page-titled) (Failure).\n\nThis failure applies to all technologies.\n\n## Description\n\nThis describes a failure condition when the web page has a title, but the title does not identify the contents or purpose of the web page.\n\n## Examples\n\n### Example 1\n\nExamples of text that are not titles include:\n\n* Authoring tool default titles, such as\n* Filenames that are not descriptive in their own right, such as report.html or spk12.html\n* Empty text\n* Filler or placeholder text\n\n### Example 2\n\nA site generated using templates includes the same title for each page on the site. So the title cannot be used to distinguish among the pages.\n\n## Related Techniques\n\n* [H25: Providing a title using the title element](../html/H25)\n\n## Tests\n\n### Procedure\n\n1. Check whether the title of each web page identifies the contents or purpose of the web page .\n\n### Expected Results\n\n* If check #1 is false, then this failure condition applies and the content fails this Success Criterion.\n"
    },
    {
      "rule_id": "F26",
      "error_class": "non_functional",
      "file": "F26.md",
      "path": "out/wcag_common_failures/F26.md",
      "content": "# Technique F26: Failure of Success Criterion 1.3.3 due to using a graphical symbol alone to convey information\n\n## About this Technique\n\nThis technique relates to [1.3.3: Sensory Characteristics](https://www.w3.org/WAI/WCAG22/Understanding/sensory-characteristics) (Failure).\n\nThis failure applies to all technologies.\n\n## Description\n\nThe objective of this technique is to show how using a graphical symbol to convey information can make content difficult to comprehend. A graphical symbol may be an image, an image of text or a pictorial or decorative character symbol (glyph) which imparts information nonverbally. Examples of graphical symbols include an image of a red circle with a line through it, a \"smiley\" face, or a glyph which represents a check mark, arrow, or other symbol but is not the character with that meaning.\n\nAssistive technology users may have difficulty determining the meaning of the graphical symbol. If a graphical symbol is used to convey information, provide an alternative using features of the technology or use a different mechanism that can be marked with an alternative to represent the graphical symbol. For example, an image with a text alternative can be used instead of the glyph.\n\n## Examples\n\n### Example 1: Glyphs Used to Indicate Status\n\nA shopping cart uses two simple glyphs to indicate whether an item is available for immediate shipment. A circle indicates that the item is in stock and ready to ship. An square indicates that the item is currently on back order and not available for immediate shipment. The instructions above items refer to the circle and square as the sole means to differentiating whether an item is available.\n\n## Related Techniques\n\n* [H37: Using alt attributes on img elements](../html/H37)\n* [ARIA14: Using aria-label to provide an accessible name where a visible label cannot be used](../aria/ARIA14)\n* [ARIA24: Semantically identifying a font icon with role=\"img\"](../aria/ARIA24)\n\n## Tests\n\n### Procedure\n\nFor each instruction that refers to non-text marks that convey information:\n\n1. Check whether there are other means to determine the information conveyed by the non-text marks.\n\n### Expected Results\n\n* If #1 is false, then this failure condition applies and the content fails this Success Criterion.\n"
    },
    {
      "rule_id": "F32",
      "error_class": "non_functional",
      "file": "F32.md",
      "path": "out/wcag_common_failures/F32.md",
      "content": "# Technique F32: Failure of Success Criterion 1.3.2 due to using white space characters to control\n                    spacing within a word\n\n## About this Technique\n\nThis technique relates to [1.3.2: Meaningful Sequence](https://www.w3.org/WAI/WCAG22/Understanding/meaningful-sequence) (Failure).\n\nThis failure applies to all technologies.\n\n## Description\n\nThe objective of this technique is to describe how using white space characters, such as space, tab, line break, or carriage return, to format individual words visually can be a failure to present meaningful sequences properly. When blank characters are inserted to control letter spacing within a word, they may change the interpretation of the word or cause it not to be programmatically recognized as a single word.\n\nInserting white space characters into an initialism is not an example of this failure, since the white space does not change the interpretation of the initialism and may make it easier to understand.\n\nThe use of white space between words for visual formatting is not a failure, since it does not change the interpretation of the words.\n\n## Examples\n\n### Example 1: Failure due to adding white space in the middle of a word\n\nThis example has white spaces within a word to space out the letters in a heading. Screen readers may read each letter individually instead of the word \"Welcome.\"\n\n```html\n<h1>W e l c o m e</h1>\n```\n\n&nbsp; can also be used to add white space, producing similar failures:\n\n```html\n<h1>H&nbsp;E&nbsp;L&nbsp;L&nbsp;O</h1>\n```\n\n### Example 2: White space in the middle of a word changing its meaning\n\nIn Japanese, Han characters (Kanji) may have multiple readings that mean very different things. In this example, the word is read incorrectly because screen readers may not recognize these characters as a word because of the white space between the characters. The characters mean \"Tokyo,\" but screen readers say \"Higashi Kyo\".\n\n```html\n<h1>東　京</h1>\n```\n\n### Example 3: Using line break characters to format vertical text\n\nIn the row header cell of a data table containing Japanese text, authors often create vertical text by using line break characters. However screen readers are not able to read the words in vertical text correctly because the line breaks occur within the word. In the following example, \"東京都\"(Tokyo-to) will be read \"Higashi Kyo Miyako\".\n\n```html\n<table>\n   <caption>表1.　都道府県別一覧表</caption>\n   <tr>\n     <td></td>\n     <th scope=\"col\">（見出しセル 1.）</th>\n     <th scope=\"col\">（見出しセル 2.）</th>\n   </tr>\n   <tr>\n     <th scope=\"row\">東<br />京<br />都</th>\n     <td>（データセル 1.）</td>\n     <td>（データセル 2.）</td>\n   </tr>\n   ...\n</table>\n```\n\n## Related Techniques\n\n* [C8: Using CSS letter-spacing to control spacing within a word](../css/C8)\n\n## Tests\n\n### Procedure\n\nFor each word that appears to have non-standard spacing between characters:\n\n1. Check whether any words in the text of the content contain white space characters .\n\n### Expected Results\n\n* If check #1 is true, then this failure condition applies and the content fails this Success Criterion.\n"
    },
    {
      "rule_id": "F7",
      "error_class": "non_functional",
      "file": "F7.md",
      "path": "out/wcag_common_failures/F7.md",
      "content": "# Technique F7: Failure of Success Criterion 2.2.2 due to an object or applet\n                    that has blinking content without a mechanism to pause the content that blinks\n                    for more than five seconds\n\n## About this Technique\n\nThis technique relates to [2.2.2: Pause, Stop, Hide](https://www.w3.org/WAI/WCAG22/Understanding/pause-stop-hide) (Failure).\n\nThis failure applies to technologies that support blinking content within an object, applet, or a plug-in.\n\n## Description\n\nWhen content that is rendered by a plug-in or contained in an applet blinks, there may be no way for the user agent to pause the blinking. If neither the plug-in, applet, nor the content itself provides a mechanism to pause the content, the user may not have sufficient time to read the content between blinks or it may be so distracting that the user will not be able to read other content on the page.\n\n## Examples\n\n* An applet displays an advertisement on a news site. The applet blinks key words in the advertisement in order to call the user's attention to it. The blinking cannot be paused through any user agent settings and the applet does not provide a mechanism to stop it.\n\n## Related Techniques\n\n* [SCR22: Using scripts to control blinking and stop it in five seconds or less](../client-side-script/SCR22)\n\n## Tests\n\n### Procedure\n\nFor each page that has blinking content in a plugin or applet:\n\n1. Determine if the content continues to blink for longer than 5 seconds.\n2. Determine if there is a means to pause the blinking content.\n\n### Expected Results\n\n* If check #1 is true and check #2 is false, the content fails the success criterion.\n"
    }
  ]
}